<?php
//Практическая работа: Основы синтаксиса PHP
//Цель:
//Закрепить знания по базовым концепциям PHP, включая переменные, типы данных, операторы
//и вывод данных.
//Задачи:


//1. Определение переменных и констант:
//Объявите несколько переменных с разными типами данных: строка, число,
//булево значение.
//Создайте константу с помощью функции define() , например, для хранения
//имени сайта.
//Выведите значения переменных и констант с помощью функций echo и
//print .



//2. Преобразование типов:
//Создайте переменную, содержащую строковое представление числа, и
//преобразуйте её в число.
//Выведите результат преобразования, а также тип переменной с помощью
//функции gettype() .


//3. Использование операторов:
//Создайте несколько переменных с числами и выполните над ними
//арифметические операции (сложение, вычитание, умножение, деление).
//Используйте операторы сравнения для сравнения этих переменных, выведите
//результат.
//Реализуйте простое логическое выражение с использованием операторов &&
//и || .



//4. Суперглобальная переменная $_SERVER:
//Выведите информацию о сервере и среде исполнения с помощью переменной
//$_SERVER . Например, выведите информацию о браузере пользователя или IPадресе.







//Шаги выполнения:
//1. Создайте PHP-файл с описанными заданиями.
//2. Разместите файл в вашем репозитории на GitHub.
//Подсказки по оформлению PHP и выполнения задания (сперва попробуйте выполнить задания
//без подсказок!):
